app/Controllers/V1/Auth.php

    public function createUser()
    {
        $data = $this->request->getJSON(true);

        if (!isset($data['nom_usuari'], $data['password_usuari'], $data['mail'], $data['edat'], $data['pais'])) {
            return $this->failValidationErrors("Falten camps obligatoris");
        }

        $userModel = new UserModel();

        // Comprovem si ja existeix
        if ($userModel->where('nom_usuari', $data['nom_usuari'])->first()) {
            return $this->failResourceExists("Aquest nom d'usuari ja existeix");
        }

        $hash = password_hash($data['password_usuari'], PASSWORD_DEFAULT);

        $userModel->insert([
            'nom_usuari' => $data['nom_usuari'],
            'password_usuari' => $hash,
            'mail' => $data['mail'],
            'edat' => $data['edat'],
            'pais' => $data['pais']
        ]);
---
SELECT *
FROM `usuaris`
WHERE `nom_usuari` = 'pep'
 LIMIT 1
INSERT INTO `usuaris` (`nom_usuari`, `password_usuari`, `mail`, `edat`, `pais`) VALUES ('pep', '$2y$10$cYFNsYpc7bx5IS2wpyUlSuQV1Kg//s0mFNt4v7HKG8ghsb.qf8ai.', 'pep@gmail.com', 2020, 'Catalunya')

    public function login()
    {
        $data = $this->request->getJSON(true);
        $userModel = new UserModel();
        $user = $userModel->where('nom_usuari', $data['nom_usuari'])->first();
---
SELECT *
FROM `usuaris`
WHERE `nom_usuari` = 'naim'
 LIMIT 1

    public function configGame()
    {
        helper('jwt');
        $userId = $this->getUserIdFromToken();

        $data = $this->request->getJSON(true);

        $db = \Config\Database::connect();
        $builder = $db->table('configuracions');
        $builder->insert([
            'usuari_id' => $userId,
            'tema' => $data['tema'],
            'musica' => $data['musica'],
            'dificultat' => $data['dificultat']
        ]);
---
INSERT INTO `configuracions` (`usuari_id`, `tema`, `musica`, `dificultat`) VALUES ('3', 'classic', 'on', 'fàcil')

    public function addGame()
    {
        helper('jwt');
        $userId = $this->getUserIdFromToken();
        $data = $this->request->getJSON(true);

        $db = \Config\Database::connect();
        $builder = $db->table('partides');
        $builder->insert([
            'usuari_id' => $userId,
            'data' => $data['data'],
            'guanyat' => $data['guanyat'],
            'punts' => $data['punts'],
            'durada' => $data['durada']
        ]);
---
INSERT INTO `partides` (`usuari_id`, `data`, `guanyat`, `punts`, `durada`) VALUES ('2', '2025-05-12 12:34:00', 1, 1750, 180)

    public function getUserStats()
    {
        helper('jwt');
        $userId = $this->getUserIdFromToken();

        $db = \Config\Database::connect();
        $builder = $db->table('partides')->where('usuari_id', $userId);
        $total = $builder->countAllResults(false);
        $guanyades = $builder->where('guanyat', true)->countAllResults(false);
        $perdudes = $total - $guanyades;

        $query = $builder->select('AVG(punts) as mitjana_punts, AVG(durada) as mitjana_durada')->get()->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `partides`
WHERE `usuari_id` = '3'
SELECT COUNT(*) AS `numrows`
FROM `partides`
WHERE `usuari_id` = '3'
AND `guanyat` = 1
SELECT AVG(punts) as mitjana_punts, AVG(durada) as mitjana_durada
FROM `partides`
WHERE `usuari_id` = '3'
AND `guanyat` = 1